{
    "examCalendar": "https://docs.google.com/presentation/d/1FYK_1kiuwi-DXkO8jpfcd_NLNIx3Er5pjq8dbGj1cS4/edit#slide=id.p",
    "academicsGuide": "https://docs.google.com/document/d/1gi7-K81MN4KLEBPCF9bv-nVxg2HMnH8ub5IXKeFM7fc/edit?usp=sharing",
    "clubLeaderResources": "https://tams.unt.edu/studentlife/clubs#clubresources",
    "tamsWiki": "https://tamswiki.org/wiki/Main_Page",
    "addCalendar": "https://calendar.google.com/calendar/u/7?cid=ODlicWE0c3FpOTRxMG9ocmtoOW5raWtvN2dAZ3JvdXAuY2FsZW5kYXIuZ29vZ2xlLmNvbQ",
    "addStagingCalendar": "https://calendar.google.com/calendar/u/7?cid=dmQxaGdjMGNnOTNvaGtlazRyczJuOXIwNDRAZ3JvdXAuY2FsZW5kYXIuZ29vZ2xlLmNvbQ",
    "daysOfTheWeek": ["Sun", "Mon", "Tues", "Wed", "Thu", "Fri", "Sat"],
    "charsOfTheWeek": ["S", "M", "T", "W", "T", "F", "S"],
    "githubLink": "https://github.com/MichaelZhao21/tams-club-cal",
    "aboutText": "Welcome to the TAMS Club Calendar! This is a simple web app that displays all the student organization events at TAMS, along with a list of clubs and other resources. Our vision is a community-maintained resource that’s avaliable to anyone and can be updated by anyone as well.\nWe are an open-source project, meaning that anyone and everyone can help contribute to the development of the website! You can go to the Github repository where this project is being hosted, where there's more information on that page about how to contribute and help code. If you can't code and still want to help, there is a feedback form below where you can write whatever you would like! The way programs like these get better, after all, is through independent user feedback. Thank you once again for checking out tams.club, and we hope you enjoy the rest of your day! :D",
    "aboutFeedback": "We would love to hear what you think and what ideas you would like to see! Here’s the form for any bugs, comments, suggestions, and anything else you would like us to know!",
    "hours": [
        "6a",
        "7a",
        "8a",
        "9a",
        "10a",
        "11a",
        "12",
        "1p",
        "2p",
        "3p",
        "4p",
        "5p",
        "6p",
        "7p",
        "8p",
        "9p",
        "10p",
        "11p"
    ],
    "rooms": [
        {
            "value": "room-mac",
            "label": "[Room] Mac Cafe"
        },
        {
            "value": "room-smitty",
            "label": "[Room] Smitty"
        },
        {
            "value": "room-conference",
            "label": "[Room] Conference"
        },
        {
            "value": "room-sac",
            "label": "[Room] SAC"
        },
        {
            "value": "room-tv",
            "label": "[Room] TV Room"
        },
        {
            "value": "room-bewley",
            "label": "[Room] Bewley"
        },
        {
            "value": "room-board",
            "label": "[Room] Board Room"
        },
        {
            "value": "room-kitchenette",
            "label": "[Room] Kitchenette"
        },
        {
            "value": "mac-park",
            "label": "Mcconnell Park Area"
        },
        {
            "value": "zoom",
            "label": "Online Event"
        },
        {
            "value": "van-382",
            "label": "[Van] #382"
        },
        {
            "value": "van-383",
            "label": "[Van] #383"
        },
        {
            "value": "van-384",
            "label": "[Van] #384"
        },
        {
            "value": "van-386",
            "label": "[Van] #386"
        },
        {
            "value": "van-387",
            "label": "[Van] #387"
        },
        {
            "value": "van-380",
            "label": "[Van] #380 (mini)"
        },
        {
            "value": "van-388",
            "label": "[Van] #388 (truck)"
        }
    ],
    "changelog": [
        {
            "v": "5.1",
            "date": "Febuary 6th, 2022",
            "changes": [
                "Fixed 'Manage Resources' table on Admin page to be a cleaner data grid",
                "Limit events to 100 days long",
                "Reservation error messages are more clear (notes if the time or location is the issue)",
                "Fixed weird icon flash when loading page",
                "Fixed issue where events that end at midnight display as 'All Day'",
                "Added text next to action bar icon buttons for readability",
                "Added [no description] to descriptions in volunteering and club cards that have no description",
                "Added link to original repeating event on repeating events",
                "Added a button to go to the current week on the reservations calendar"
            ]
        },
        {
            "v": "5.0",
            "date": "Febuary 1st, 2022",
            "changes": [
                "Completely overhauled events system",
                "Removed seperate reservation add page",
                "Added ability to make repeating events",
                "Added ability to repeat events weekly and monthly",
                "Repeating events are now labeled on the schedule view",
                "Top navigation bar no longer disappears when scrolling down",
                "Volunteering opportunities will now be open by default when creating them",
                "Fixed issue where edit history looks janky when creating a resource",
                "Fixed issue where edit history page would crash if accessing a deleted resource",
                "Fixed issue where edit history entries were not deleted when admins deleted resources",
                "Club committee cards will now properly display committee heads"
            ]
        },
        {
            "v": "4.2",
            "date": "January 21st, 2022",
            "changes": [
                "Fixed events not all loading in schedule view",
                "Fixed issue where the calendar would not move correctly to December"
            ]
        },
        {
            "v": "4.1",
            "date": "January 14th, 2022",
            "changes": [
                "Fixed issue where users could no longer log in",
                "Fixed issue where changing the dark theme would not save when page refreshes",
                "Added missing staging text on the staging app"
            ]
        },
        {
            "v": "4.0",
            "date": "January 14th, 2022",
            "changes": [
                "Completely reworked code framework so pages now load faster",
                "Added support for unique page previews on social media and google"
            ]
        },
        {
            "v": "3.2",
            "date": "January 12th, 2022",
            "changes": [
                "Removed random debugging log statements",
                "Created a new menu theme for light mode",
                "Updated elevation of menu bar",
                "Darkened the EDIT HISTORY text on light mode",
                "Added a light green background for light mode",
                "Created a new system for logging in and profiles - see the new profile menu icon!",
                "Created an admin dashboard",
                "Fixed event reservation system so that users can now choose whether or not to create a reservation from an event",
                "Added text to show whether or not an event is reserved",
                "Fixed issue where users could schedule reservations over other reservations",
                "Changed edit history entries to be more human readable",
                "Changed text on events to be Signup/Deadline instead of just Signup",
                "Fixed strange margins on volunteering display",
                "Fixed new issue where users could set event end times to be before start times",
                "Fixed issue where images are not deleted from the database when clubs are deleted",
                "Fixed weird loading box bottom on the main page",
                "Added a [No Description] label if an event has no description",
                "Added this changelog",
                "Removed id data from future edit history entries"
            ]
        },
        {
            "v": "3.1",
            "date": "December 1st, 2021",
            "changes": ["Fixed feedback form"]
        },
        {
            "v": "3.0",
            "date": "November 29, 2021",
            "changes": [
                "Cleaned up slow code and upgraded styling libraries for an overall smoother experience",
                "Fixed edit form submission issues",
                "Added catch for invalid edit history entires so it no longer crashes the site",
                "Changing volunteering from closed to open actually works now"
            ]
        }
    ]
}
