{
    "daysOfTheWeek": ["Sun", "Mon", "Tues", "Wed", "Thu", "Fri", "Sat"],
    "charsOfTheWeek": ["S", "M", "T", "W", "T", "F", "S"],
    "githubLink": "https://github.com/MichaelZhao21/tams-club-cal",
    "aboutText": "Welcome to the TAMS Club Calendar! This is a simple web app that displays all the student organization events at TAMS, along with a list of clubs and other resources. Our vision is a community-maintained resource that’s available to anyone and can be updated by anyone as well.\nWe are an open-source project, meaning that anyone and everyone can help contribute to the development of the website! You can go to the Github repository where this project is being hosted, where there's more information on that page about how to contribute and help code. If you can't code and still want to help, there is a feedback form below where you can write whatever you would like! The way programs like these get better, after all, is through independent user feedback. Thank you once again for checking out tams.club, and we hope you enjoy the rest of your day! :D",
    "aboutFeedback": "We would love to hear what you think and what ideas you would like to see! Here’s the form for any bugs, comments, suggestions, and anything else you would like us to know!",
    "hours": [
        "6a",
        "7a",
        "8a",
        "9a",
        "10a",
        "11a",
        "12",
        "1p",
        "2p",
        "3p",
        "4p",
        "5p",
        "6p",
        "7p",
        "8p",
        "9p",
        "10p",
        "11p"
    ],
    "rooms": [
        {
            "value": "room-mac",
            "label": "[Room] Mac Cafe"
        },
        {
            "value": "tabling-mac",
            "label": "Tabling in Mac"
        },
        {
            "value": "room-smitty",
            "label": "[Room] Smitty"
        },
        {
            "value": "room-conference",
            "label": "[Room] Conference"
        },
        {
            "value": "room-sac",
            "label": "[Room] SAC"
        },
        {
            "value": "room-computer",
            "label": "[Room] Computer Lab"
        },
        {
            "value": "room-tv",
            "label": "[Room] TV Room"
        },
        {
            "value": "room-bewley",
            "label": "[Room] Bewley"
        },
        {
            "value": "room-kitchenette",
            "label": "[Room] Kitchenette"
        },
        {
            "value": "mac-park",
            "label": "Mcconnell Park Area"
        },
        {
            "value": "zoom",
            "label": "Online Event"
        },
        {
            "value": "van-382",
            "label": "[Van] #382"
        },
        {
            "value": "van-383",
            "label": "[Van] #383"
        },
        {
            "value": "van-384",
            "label": "[Van] #384"
        },
        {
            "value": "van-386",
            "label": "[Van] #386"
        },
        {
            "value": "van-387",
            "label": "[Van] #387"
        },
        {
            "value": "van-380",
            "label": "[Van] #380 (mini)"
        },
        {
            "value": "van-388",
            "label": "[Van] #388 (truck)"
        }
    ],
    "howToUse": [
        {
            "section": "General",
            "text": "The site is organized into 3 main resource types: events, volunteering, and clubs. For the most part, a normal TAMS student would only need to create/edit events. Volunteering and club resources are there as a reference point for students who want to familiarize themselves with or find new clubs/volunteering to go to."
        },
        {
            "section": "Events",
            "text": "[WIP]"
        },
        {
            "section": "Reservations",
            "text": "[WIP]"
        },
        {
            "section": "Volunteering",
            "text": "[WIP]"
        },
        {
            "section": "Clubs",
            "text": "[WIP]"
        },
        {
            "section": "Accounts",
            "text": "[WIP]"
        },
        {
            "section": "Admin",
            "text": "[WIP]"
        }
    ],
    "changelog": [
        {
            "v": "6.2.1",
            "date": "August 11, 2022",
            "changes": [
                "Changed the \"editAll\" checkbox to a significantly more intuitive popup when editing repeating events",
                "Added the ability to edit start/end times for repeating events",
                "Added checking for overlapping events when editing repeating events",
                "Added the \"start\" and \"end\" word to event display cards that span multiple days",
                "Added the location to the event list"
            ]
        },
        {
            "v": "6.2",
            "date": "August 9, 2022",
            "changes": [
                "Added a simpler repeating events system",
                "Fixed typo on about page",
                "Fixed club/type/description line of event list",
                "Modified club access level permissions to add and delete clubs",
                "Remove board room from reservation list"
            ]
        },
        {
            "v": "6.1",
            "date": "July 12, 2022",
            "changes": [
                "Completely rewrote the reservation calendar with divs that display finer (minute) detail on reservations",
                "Reservations can now be made down to the minute",
                "Fixed issue where login token cookies were not being saved",
                "Added new colors for light theme",
                "Added back event type with a dropdown in the edit menu",
                "Added the ability to filter events by event type",
                "Added a loading screen to the home page",
                "Fixed invalid pagination on the admin page",
                "Clicking on an edit entry on /edit will now open the popup with those specific edits",
                "Reworded the checkbox to create a private (non-public) event"
            ]
        },
        {
            "v": "6.0",
            "date": "June 13, 2022",
            "changes": [
                "Updated icons on external links",
                "Added ability to edit external links on the admin dashboard",
                "Fixed spelling mistake on the add button",
                "Added access level system for all users",
                "Added ability to edit access levels on the admin dashboard",
                "Fixed glitches with the login button",
                "Profile button now links to /profile/dashboard",
                "Added delete buttons to resource edit pages",
                "Added dialog explaining access levels on the edit main page",
                "Added ability to view feedback on the admin dashboard",
                "Removed repeating events",
                "Added the ability to create duplicates of existing events",
                "Location names now display nicely on the edit history"
            ]
        },
        {
            "v": "5.4",
            "date": "May 27, 2022",
            "changes": ["Created new Github workflows", "Updated many internal components"]
        },
        {
            "v": "5.3",
            "date": "May 24, 2022",
            "changes": [
                "Fixed issue where favicon was not displaying",
                "Fixed issue where meta tags did not update correctly",
                "Calendar popup now shows when clicking anywhere on a calendar day",
                "Fixed issue where calendar events were not highlighted correctly"
            ]
        },
        {
            "v": "5.2",
            "date": "March 9, 2022",
            "changes": [
                "Added computer lab as a reservable room, as well as a reservation for tabling in Mac",
                "Removed redundant 'Add Reservation' button on the edit page",
                "Fixed random icon flash on page load (again)",
                "Created new documentation page, still hosted at https://docs.tams.club"
            ]
        },
        {
            "v": "5.1",
            "date": "Febuary 6th, 2022",
            "changes": [
                "Fixed 'Manage Resources' table on Admin page to be a cleaner data grid",
                "Limit events to 100 days long",
                "Reservation error messages are more clear (notes if the time or location is the issue)",
                "Fixed weird icon flash when loading page",
                "Fixed issue where events that end at midnight display as 'All Day'",
                "Added text next to action bar icon buttons for readability",
                "Added [no description] to descriptions in volunteering and club cards that have no description",
                "Added link to original repeating event on repeating events",
                "Added a button to go to the current week on the reservations calendar"
            ]
        },
        {
            "v": "5.0",
            "date": "Febuary 1st, 2022",
            "changes": [
                "Completely overhauled events system",
                "Removed seperate reservation add page",
                "Added ability to make repeating events",
                "Added ability to repeat events weekly and monthly",
                "Repeating events are now labeled on the schedule view",
                "Top navigation bar no longer disappears when scrolling down",
                "Volunteering opportunities will now be open by default when creating them",
                "Fixed issue where edit history looks janky when creating a resource",
                "Fixed issue where edit history page would crash if accessing a deleted resource",
                "Fixed issue where edit history entries were not deleted when admins deleted resources",
                "Club committee cards will now properly display committee heads"
            ]
        },
        {
            "v": "4.2",
            "date": "January 21st, 2022",
            "changes": [
                "Fixed events not all loading in schedule view",
                "Fixed issue where the calendar would not move correctly to December"
            ]
        },
        {
            "v": "4.1",
            "date": "January 14th, 2022",
            "changes": [
                "Fixed issue where users could no longer log in",
                "Fixed issue where changing the dark theme would not save when page refreshes",
                "Added missing staging text on the staging app"
            ]
        },
        {
            "v": "4.0",
            "date": "January 14th, 2022",
            "changes": [
                "Completely reworked code framework so pages now load faster",
                "Added support for unique page previews on social media and google"
            ]
        },
        {
            "v": "3.2",
            "date": "January 12th, 2022",
            "changes": [
                "Removed random debugging log statements",
                "Created a new menu theme for light mode",
                "Updated elevation of menu bar",
                "Darkened the EDIT HISTORY text on light mode",
                "Added a light green background for light mode",
                "Created a new system for logging in and profiles - see the new profile menu icon!",
                "Created an admin dashboard",
                "Fixed event reservation system so that users can now choose whether or not to create a reservation from an event",
                "Added text to show whether or not an event is reserved",
                "Fixed issue where users could schedule reservations over other reservations",
                "Changed edit history entries to be more human readable",
                "Changed text on events to be Signup/Deadline instead of just Signup",
                "Fixed strange margins on volunteering display",
                "Fixed new issue where users could set event end times to be before start times",
                "Fixed issue where images are not deleted from the database when clubs are deleted",
                "Fixed weird loading box bottom on the main page",
                "Added a [No Description] label if an event has no description",
                "Added this changelog",
                "Removed id data from future edit history entries"
            ]
        },
        {
            "v": "3.1",
            "date": "December 1st, 2021",
            "changes": ["Fixed feedback form"]
        },
        {
            "v": "3.0",
            "date": "November 29, 2021",
            "changes": [
                "Cleaned up slow code and upgraded styling libraries for an overall smoother experience",
                "Fixed edit form submission issues",
                "Added catch for invalid edit history entires so it no longer crashes the site",
                "Changing volunteering from closed to open actually works now"
            ]
        },
        {
            "v": "2.3",
            "date": "August 29, 2021",
            "changes": [
                "Fixed location that images were stored in the staging app",
                "Fixed issue where scroll bar appears illegally on the reservation calendar"
            ]
        },
        {
            "v": "2.2",
            "date": "August 13, 2021",
            "changes": [
                "Added social media meta tags -- better links for social media!",
                "Created documentation site (https://docs.tams.club)",
                "Fixed issues with reservations and events displaying incorrectly",
                "Adding sorting functionality to list views"
            ]
        },
        {
            "v": "2.1",
            "date": "August 6, 2021",
            "changes": [
                "General improvements to user interface",
                "Created list views and filters for resource lists",
                "Added the ability to reserve rooms for reservations",
                "Added ability to schedule repeating reservations",
                "Added React Helmet to dynamically change page title/descriptions",
                "Fixed issue where edit history does not show logged in user's name",
                "Created /edit page where a log of all edits are displayed",
                "Added the ability to view individual resource's edit histories",
                "History diff now recursively shows arrays and objects that are changed"
            ]
        },
        {
            "v": "2.0",
            "date": "July 30, 2021",
            "changes": [
                "Completely rewrote the entire user interface with a modern framework library (Material UI)",
                "Cleaned up backend with routers and mongoose",
                "Serve images from Amazon S3 at https://cdn.tams.club",
                "Create production builds with a combination of Netlify and Docker"
            ]
        },
        {
            "v": "1.4",
            "date": "March 29, 2021",
            "changes": [
                "Add text on staging app denoting its non-production status",
                "Set default signup time to 11:59pm",
                "Changing start time for events now perserves the previous time interval",
                "Add button no longer expands weirdly on mobile",
                "Fixed the width of club cover photo uploads",
                "Added ability to edit clubs on mobile",
                "Set dark theme automatically for first-time users who have dark theme enabled globally"
            ]
        },
        {
            "v": "1.3",
            "date": "March 26, 2021",
            "changes": [
                "Dark theme added!",
                "Wrap long event names on event display",
                "Added a max height to event popups to prevent clipping beyond bottom of the popup"
            ]
        },
        {
            "v": "1.2",
            "date": "March 21, 2021",
            "changes": [
                "Fixed info on left side of events popup",
                "Added a minimum height for event popups",
                "Changed media queries so that it works on mobile",
                "Added transitions and border-radii to calendar events on hover",
                "Cleaned up CSS code"
            ]
        },
        {
            "v": "1.1",
            "date": "Narch 19, 2021",
            "changes": [
                "Fixed layering on the home page",
                "Fix background tasks to run only once every day",
                "Fix issue where volunteering cards are clipped and overlaid strangely",
                "Set logo banner of clubs to 100% so they don't overflow",
                "Fixed issue where Google account logins do not work"
            ]
        },
        {
            "v": "1.0",
            "date": "March 7, 2021",
            "changes": [
                "Use set timezone of America/Chicago (for simplicity)",
                "Added link to Google Calendar",
                "Catch invalid ips for users and log them out automatically",
                "Fix padding issues with club displays"
            ]
        }
    ]
}
