[
    {
        "id": "f3bd55e7-ebe1-4c6c-89ec-06bc6cd2992e",
        "name": "Computer Science Organization (CSO)",
        "advised": true,
        "links": ["https://www.facebook.com/groups/CSO2021", "https://cso.tams.club"],
        "description": "The TAMS Computer Science Organization (CSO) exposes students to the wide array of topics within computer science such as web development, cybersecurity, APIs, hardware, and much more! It doesn't matter if you have no experience or you aren't in the CS track. Join us as we help you find your passion! All of our projects are on our Github organization page: https://github.com/tams-cso. We also have a rad website you can check out below :DDD",
        "coverImgThumbnail": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/cso.png",
        "coverImg": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/cso.png",
        "execs": [
            {
                "name": "Ben Wang",
                "position": "President",
                "description": "",
                "img": ""
            },
            {
                "name": "Anthony Zhou",
                "position": "Competitions Director",
                "description": "",
                "img": ""
            },
            {
                "name": "Michael Zhao",
                "position": "Secretary",
                "description": "UwU I like organizing stuff",
                "img": "https://cdn.michaelzhao.xyz/misc/me.jpg"
            },
            {
                "name": "Jon Choi",
                "position": "Volunteering Director",
                "description": "",
                "img": ""
            },
            {
                "name": "Pranoy Dutta",
                "position": "Treasurer",
                "description": "",
                "img": ""
            }
        ],
        "committees": [
            {
                "name": "USACO",
                "description": "We are the TAMS USACO Committee under CSO. Our committee is committed to helping TAMS students learn all there is about the USACO programming contest, including what it is, how to prepare for it, and what to do during the contest. We will cover algorithms and data structures necessary to pass the Bronze, Silver, and Gold Divisions of the USACO contest, as well as host practice contests in tandem with CSO.",
                "links": ["https://www.facebook.com/groups/3578375718845467/"]
            },
            {
                "name": "Open Source",
                "description": "We want to make an impact in open-source projects and introduce TAMS students to the many benefits of contributing to open source, including developing their coding expertise, developing problem solving skills, and the knowledge that you are making a sizable impact to thousands of people worldwide.",
                "links": ["https://www.facebook.com/groups/633979174126891/"]
            },
            {
                "name": "Web Dev",
                "description": "The TAMS Web Dev Committee is a community for TAMS students interested in web development. In this community, web developers will be able to gain the experience of collaborating with others to create professional websites. The committee also aims to educate people in web development, which will be done through workshops.",
                "links": ["https://www.facebook.com/groups/250029143103763/"]
            },
            {
                "name": "Girls Who Code",
                "description": "We are the TAMS committee of Girls Who Code under CSO! Our mission is to encourage girls in the Denton area to pursue careers in computer science by working with the organization Girls Who Code and volunteering with local schools. Come join us in our efforts to close the gender gap in CS and change the image of modern programmers!",
                "links": ["https://www.facebook.com/groups/288925415838249/"]
            },
            {
                "name": "API Masters",
                "description": "Our vision is to serve and inspire the TAMS community and the greater Denton community by instructing and involving student developers in the use of APIs. We aim to spread information of APIs and cool API projects through a novel approach of “mini-thons,” which are miniature hackathons, an involved and encouraging Facebook community, and community outreach.",
                "links": ["https://www.facebook.com/groups/267939461256242/"]
            },
            {
                "name": "Cybersecurity",
                "description": "The TAMS CSO Cybersecurity Committee is here to introduce you to the fascinating world of computer security. We will be hosting theoretical and practical lessons as well as hands-on activities and competitions to develop skills in binary exploitation, reverse engineering, networking, digital forensics, and cryptography. Come and join if you would like to push the boundaries of your knowledge in computer science beyond what you are taught!",
                "links": ["https://www.facebook.com/groups/hacking.cso.tams/"]
            },
            {
                "name": "Hardware",
                "description": "The TAMS Hardware Committee aims to provide computer hardware related services to the TAMS community in the form of workshops and volunteering opportunities. As a CSO committee, we run hands on biweekly workshops where we teach concepts in digital logic, electrical engineering, and programming. We also run PCs2Prosper, a volunteering opportunity where you can sign up to refurbish and fix laptops and computers for people in need.",
                "links": ["https://www.facebook.com/groups/579625052673505/"]
            },
            {
                "name": "Tech-Ed",
                "description": "Tech-Ed is a committee under TAMS CSO that aims to facilitate learning through a variety of online mediums as we enter a new age of remote education. Our mission is to help students within and beyond the TAMS community to simultaneously discover valuable educational resources and expand their own “range” by providing weekly posts on a plethora of thought-invoking subjects.",
                "links": ["https://www.facebook.com/groups/tamsteched20202021"]
            },
            {
                "name": "Missing Maps",
                "description": "Our mission is to help map areas where people in need live. Use satellite images to trace buildings, roadways, and other features in vulnerable areas. No computer science experience needed and completely beginner-friendly! Volunteering hours will be determined by the number of features mapped.",
                "links": ["https://www.facebook.com/groups/292534141766054/"]
            }
        ]
    },
    {
        "id": "2b14d749-029b-411e-8966-b38327b045c3",
        "name": "Helping Other People Everywhere (HOPE)",
        "advised": true,
        "links": ["https://www.facebook.com/groups/hope2021", "https://www.tamshope.org/"],
        "description": "HOPE, Helping Other People Everywhere, is the largest student-led organization dedicated to community service at the Texas Academy of Mathematics & Science in Denton, TX. We provide year-round volunteering through our 18 committees, host the annual HOPE Auction charity fundraiser, hold four blood drives in collaboration with Carter BloodCare throughout the year, and much more! ",
        "coverImgThumbnail": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/hope.jpg",
        "coverImg": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/hope.jpg",
        "execs": [
            {
                "name": "Saatvik Sunkavalli",
                "position": "President",
                "description": "Hey! I’m Saatvik, your 2020-2021 HOPE President. I’m from the city of Flower Mound, and I went to the one and only Flower Mound HS (Jaggy is my BFF btw). When I’m free, I like to spend my time completing the IMDb top 100 movies list, trying new food, and taking 6-hour naps. I also REALLY love public speaking. If there’s a competition that involves public speaking, I’ll be there. Speech and Debate, Model UN, DECA, you name it. On that note, I’m also your TAMS Speech and Debate Captain, so join the Speech and Debate team! Anyway, I’m so excited to get to know all of you this year! If you ever want to chat, just mention anything in this description, and I will talk FOREVER. I really enjoy meeting new people, so don’t be afraid to say hi!",
                "img": ""
            },
            {
                "name": "Braiden Aaronson",
                "position": "Vice President",
                "description": "Heyo!! I’m Braiden, and I am your HOPE Vice President for the 2020-2021 school year! I was born in Arizona and now live in the southwest DFW area. Before coming to TAMS, I went to the Fort Worth Academy of Fine Arts. One of the things that I love doing is singing, I’ve been singing with choirs since I was six years old! With my experiences singing, I have been able to be on multiple CDs (one of them Grammy nominated!) and travel across the world to places like Germany and China. I also love hanging out with my friends, so you can catch me hanging out in MAC or around campus with people. I have a pretty wide range of interests, so let me know if you want to talk about anything from planes to politics to whatever could be interesting. Feel more than free to reach out and say hi, I am so excited to meet all of you and have a great year with y’all!",
                "img": ""
            },
            {
                "name": "Lvy Liang",
                "position": "Secretary",
                "description": "Hey buds! I’m Ivy and I’ll be your HOPE Secretary for the 2020-2021 school year. I am also known as wordhunt god and for taking pictures with the Bucee's beaver every Houston bus. If you ride the Houston bus, I encourage you to take pics with me :)) I was born and raised in Houston where I went to Klein Oak High School before coming to TAMS. I love trying new food and getting boba so hmu if you want to visit new restaurants with me! You can catch me either throwing disc in Mac park, “studying” in Chilton, working out at the gym, or playing various instruments. Feel free to reach out if you have any questions or if you just want to hang; I’m always open to meeting new people! In addition to being the secretary of HOPE, I am also an exec of Student Council and one of your volleyball captains. A few of my favorite memories from my junior year include biking to Sams and Sharetea at 9PM and spontaneously ubering to Six Flags. ​",
                "img": ""
            },
            {
                "name": "Harish Sridharan",
                "position": "Treasurer",
                "description": "This your boi, the one and only, DaBabu. Lol I am just kidding. My name is Harish. I love to talk and hang out with people so if yall ever wanna talk or hang out just feel free to hit me up. If you also want someone to teach you frisbee or throw around the disc I got you too. ",
                "img": ""
            },
            {
                "name": "Amy Guan",
                "position": "Social Coordinator",
                "description": "Hey friends! My name is Amy, and I’m excited to be your 2020-2021 HOPE Social Coordinator! I'm from Jasper High School in Plano, which was definitely quite the experience (silver lining is at least the giant workload meant some good friendship bonding as we tried not to die together). You can catch me grinding at Willis (aka trying not to fall asleep), treating myself with Costco snacks 24/7 (someone really needs to take my boom chicka pop bag away from me), trying to find the motivation to go to the gym, and, of course, helping other people everywhere ;) Definitely reach out on messenger (or just whenever you see me around) if you have any questions about HOPE, TAMS, or life in general (or if you just wanna catch up and help me eat some of my dried mangoes)!",
                "img": ""
            }
        ],
        "committees": [
            {
                "name": "Denton Nursing Home",
                "description": "Denton Nursing Home (DNH) is a joint committee, under both Helping Other People Everywhere (HOPE) and TAMS Medical Society (TMS). DNH provides students the opportunity to interact with the residents of the Good Samaritan Society Nursing Home, twice a week. Our volunteering opportunities include making crafts, hosting parties, and, in general, playing games and spending time with the residents of the nursing home. We plan on holding a diverse array of events, such as holding a prom for the Nursing Home Residents and making gift boxes, in order to make an impact on the nursing home and the Denton community. ",
                "links": ["https://www.facebook.com/groups/679711992830577/", "https://www.tamshope.org/dnh"]
            },
            {
                "name": "Elm Form",
                "description": "This is TAMS Elm Fork Education Center Volunteering, a committee of HOPE! Our mission is to implement environmental education programs that encourage responsible environmental decision making for students of all ages. We provide opportunities for TAMS students to help run field trips and homeschool labs. Volunteering with us is a very easy way to give back to UNT and to inspire children to be passionate about science. ",
                "links": ["https://www.facebook.com/groups/239746690633889/", "https://www.tamshope.org/elmfork"]
            },
            {
                "name": "Food for Thought",
                "description": "Food for Thought is dedicated to providing those in the Denton area with a consistent means of obtaining food. Our volunteering includes programs at the UNT Food Pantry and other surrounding food bank and soup kitchen organizations. ",
                "links": ["https://www.facebook.com/groups/243363200237827/", "https://www.tamshope.org/fft"]
            },
            {
                "name": "Friends Forever",
                "description": "Friends Forever focuses on fostering new relationships between children with special needs and TAMS students. In partnership with It’s A Sensory World, this program aims to provide students with the opportunity to develop friendships. Friends Forever will match 1 or 2 teens and a child with special needs based on similar interests and passions. This committee offers a unique opportunity for students to stay connected and create an inclusive community that nurtures a comfortable and welcoming environment for new friendships to form. ",
                "links": ["https://www.facebook.com/groups/116955926880005", "https://www.tamshope.org/friendsforever"]
            },
            {
                "name": "Habitat for Humanity",
                "description": "Every night, there are an estimated 553,742 people in the United States experiencing homelessness. Through Habitat for Humanity (HFH), a committee under Helping Other People Everywhere (HOPE), we have the power to help change that. We have multiple volunteering opportunities each month to give back to the Denton community, helping families in need of decent and affordable housing. Volunteering is hands-on, involving construction work such as landscaping, cleaning, and painting. ",
                "links": ["https://www.facebook.com/groups/267276941111592/", "https://www.tamshope.org/hfh"]
            },
            {
                "name": "Helping Hands",
                "description": "Helping Hands' goal is to give back to the community by serving the homeless and underprivileged. We will be providing volunteering opportunities with the Salvation Army in Denton throughout the year and would love for you guys to participate/volunteer with us in order to better the lives of the individuals we are serving. Volunteering might include food serving, cleaning, serving at the shelter, etc. ",
                "links": ["https://www.facebook.com/groups/863559327478126/", "https://www.tamshope.org/helpinghands"]
            },
            {
                "name": "High School Tutoring",
                "description": "High School Tutoring is a HOPExTAS committee focused on helping local Denton high school students with STEM-related curriculum. TAMS volunteers will each be paired with a student from one of these high schools and will work with them on whatever academic help they need. ",
                "links": ["https://www.facebook.com/groups/715834289190110/", "https://www.tamshope.org/hst"]
            },
            {
                "name": "Hoofbeats",
                "description": "Hoofbeats aims to help engage students in the amazing healing process of equine therapy. We work with New Hope organization in Argyle, Texas where you will be able to aid in therapeutic horseback riding for young students with a variety of disabilities. ",
                "links": ["https://www.facebook.com/groups/265769261137721/", "https://www.tamshope.org/hoofbeats"]
            },
            {
                "name": "Learning Through Borders",
                "description": "Learning Through Borders (LTB) strives to help you connect to students across the world. LTB is a project under the Worldwide Education Fund, who assists existing hostels, orphanages, schools and other institutions and organizations that are committed to educating underprivileged children who have limited access to a quality education because of poverty, religion, gender, or other factors. ",
                "links": ["https://www.facebook.com/groups/249407289773558/", "https://www.tamshope.org/ltb"]
            },
            {
                "name": "Library Committee",
                "description": "The overarching goal of the Library Committee is to break down barriers in education and to provide all students with equal opportunities. Our main volunteering project throughout the year is with the Denton Public Library, where we help biweekly with anything the library needs. Libraries can be an oasis of information in areas that lack other resources. TLC works to facilitate the library’s operations in an effort to expand its reach, In addition, this year, we are looking to hold a book drive to collect books for students in third world countries that don’t have access to them. ",
                "links": ["https://www.facebook.com/groups/290369112125595/", "https://www.tamshope.org/tlc"]
            },
            {
                "name": "Little Leaps",
                "description": "Little Leaps’ mission is to serve local underprivileged daycares and youth centers, and support children (ages 1-5) so they can get quality care and education they deserve! ",
                "links": ["https://www.facebook.com/groups/685808418858493/", "https://www.tamshope.org/littleleaps"]
            },
            {
                "name": "Pet Shelter",
                "description": "We are a volunteer group that visits Denton’s Pet Shelter every week. We usually help out with chores and also play with the animals there. ",
                "links": ["https://www.facebook.com/groups/620419498823689/", "https://www.tamshope.org/petshelter"]
            },
            {
                "name": "Revive",
                "description": "REVIVE provides students the opportunity to interact with children with special needs to allow for the parents to enjoy a night out. This is a committee under Helping Other People Everywhere (HOPE) and will occur every other Friday. REVIVE allows students to play board games, watch movies, make arts and crafts, and video games. ",
                "links": ["https://www.facebook.com/groups/820045905152158/", "https://www.tamshope.org/revive"]
            },
            {
                "name": "Robotics Mentoring",
                "description": "We are the TAMS Robotics Mentoring, a committee in collaboration with HOPE and Robotics.We will be mentoring an FTC (First Tech Challenge) team at a local Denton middle school and teach them the basics of robotics. In addition to mentoring a team, we will also host a local FTC tournament and provide opportunities to volunteer at other events. ",
                "links": ["https://www.facebook.com/groups/roboticsmentoring/", "https://www.tamshope.org/robotics"]
            },
            {
                "name": "SCRAP",
                "description": "SCRAP is a committee under HOPE that holds volunteering sessions every week (Tuesday or Wednesday afternoons) to help the local SCRAP store. SCRAP is a nonprofit organization that aims to reduce waste and encourage environmentally sustainable actions by providing affordable, reusable materials. Our goal is to aid the SCRAP store by sorting the merchandise and creating exciting crafts for the store to sell with the donated materials they give us. ",
                "links": ["https://www.facebook.com/groups/226126288712948/", "https://www.tamshope.org/scrap"]
            },
            {
                "name": "Shiloh Field",
                "description": "Shiloh Field Community Garden is this year's new joint committee under Hope and Naturally! Shiloh Field Community Garden provides students the opportunity once a week to grow fresh produce at Denton's very own Shiloh Field. At Shiloh Field volunteers serve the community by tending to the 152 individual plots, with fruit trees, blackberries, chickens, honey bees, a vineyard, composting, and more! This is a great opportunity to learn more about the food we eat and to feed those who are hungry. ",
                "links": ["https://www.facebook.com/groups/3193208324056580/", "https://www.tamshope.org/shilohfield"]
            },
            {
                "name": "Special Olympics",
                "description": "Special Olympics is a committee under HOPE that holds volunteering sessions every week in order to help out at our local Special Olympics team! Special Olympics is an organization that provides training and competition for various sports, to people with disabilities, throughout the year. Our goal is to aid the Special Olympics team by providing good coaching to the athletes and by being kind and empathetic volunteers. ",
                "links": [
                    "https://www.facebook.com/groups/227034718622877/",
                    "https://www.tamshope.org/specialolympics"
                ]
            },
            {
                "name": "Teen Court",
                "description": "Teen Court provides members of the TAMS community with opportunities to volunteer at the Denton Municipal Teen Court on the first and third Tuesday of every month. Volunteers can participate as attorneys or jury members in cases with other Denton teens. As a result, Teen Court volunteers are exposed to real-world settings and provide a great service to our city at large. ",
                "links": ["https://www.facebook.com/groups/2624299394479160/", "https://www.tamshope.org/teencourt"]
            },
            {
                "name": "UIL Volunteering",
                "description": "We host volunteering events at local UIL competitions, and help tutor students for UIL competitions at nearby schools. Our goal is to help these events run smoothly, and volunteering includes monitoring tests, grading exams, and running papers among other things. ",
                "links": ["https://www.facebook.com/groups/829262814233384/", "https://www.tamshope.org/uil"]
            }
        ]
    },
    {
        "id": "a86fafb2-fc75-4406-819e-46fa4bd57a76",
        "name": "Ballot",
        "advised": true,
        "links": ["https://www.facebook.com/groups/265378090967162/"],
        "description": "Ballot is a TAMS club dedicated to bringing Model UN, speech, debate, and political awareness to the TAMS community. We give students a stage to share their passions in TEDxtalks, connect science with politics at SciMUN, and work with UNT's Model International Organization (MIO) to organize the annual Model Arab League (MAL), and help students compete at competitions through our Speech and Debate teams. Our goal is to help students develop skills in logical thinking, public speaking, and civic discourse which will empower them to be informed and capable leaders of the future in any career.\n\nMessage any of the execs or send an email to ballot.tams@gmail.com if you have any questions, concerns or ideas!",
        "coverImgThumbnail": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/ballot.jpg",
        "coverImg": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/ballot.jpg",
        "execs": [
            {
                "name": "Yashvini Deva",
                "position": "President",
                "description": "",
                "img": ""
            },
            {
                "name": "Daniel Li",
                "position": "Director of Competitions",
                "description": "",
                "img": ""
            },
            {
                "name": "Sriya Sadhu",
                "position": "Director of Events",
                "description": "",
                "img": ""
            },
            {
                "name": "Jalini Balasubramaniam",
                "position": "Director of Logistics",
                "description": "",
                "img": ""
            },
            {
                "name": "Abi Kumar",
                "position": "Director of Outreach",
                "description": "",
                "img": ""
            }
        ],
        "committees": []
    },
    {
        "id": "6ebe634e-69cb-4df8-a536-3ddb25aedc81",
        "name": "TAMS Culinary Society (TCS)",
        "advised": false,
        "links": ["https://www.facebook.com/groups/tamsculinarysociety"],
        "description": "TCS is a student-led cooking club that is dedicated to bringing together a community through cooking and food. We offer after-curfew food, cater to TAMS events, and host food-related events. Our goal this year is to provide a virtual cooking experience through live streams and cooking sessions to help chefs of all levels sharpen their skills while creating delicious food.",
        "coverImgThumbnail": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/tcs.png",
        "coverImg": "https://cdn.michaelzhao.xyz/misc/tams-club-cal/tcs.png",
        "execs": [
            { "name": "Vigna Lavu", "position": "President", "description": "", "img": "" },
            { "name": "Ailsa Kokoricha", "position": "Vice President", "description": "", "img": "" },
            { "name": "Nicholas Tran", "position": "Treasurer", "description": "", "img": "" },
            { "name": "Aurelia Wang", "position": "Logistics Supervisor", "description": "", "img": "" },
            { "name": "Claire Zeng", "position": "Events Coordinator", "description": "", "img": "" }
        ],
        "committees": []
    }
]
